ihartwig/STM32L4R9I_ALT_GAUGE/Core/Src/main.c
  /*
   * This task handles interrupts from MFX GPIO expander
   * Only Touch Controller Interrupt is handled
   */
  
  uint32_t statusGpio;
  
  /* Infinite loop */
  for(;;)
  {
    /* Try to acquire mutex, wait for until it's released by EXTI IRQ Callback */
    osSemaphoreAcquire(mfxBinarySemHandle, osWaitForever);
    
    /* Disable MFX interrupt to manage current one */
    HAL_NVIC_DisableIRQ(MFX_INT_EXTI_IRQn);

    uint32_t irqPending = MFX_IO_Read(IDD_I2C_ADDRESS, MFXSTM32L152_REG_ADR_IRQ_PENDING);
     
    /* GPIO IT from MFX */
    if(irqPending & 0x01 /* MFX_IRQ_PENDING_GPIO */)
    {
      statusGpio = BSP_IO_ITGetStatus(RIGHT_JOY_PIN | LEFT_JOY_PIN | UP_JOY_PIN | DOWN_JOY_PIN | SD_DETECT_PIN | TS_INT_PIN);
      
      /* Clear IO Expander IT */
      BSP_IO_ITClear(statusGpio);
    }

    irqPending &= ~ 0x01 /* MFX_IRQ_PENDING_GPIO */;
    if (irqPending)
    {
      MFX_IO_Write(IDD_I2C_ADDRESS, MFXSTM32L152_REG_ADR_IRQ_ACK, irqPending);
    }
    
    /* Re-enable MFX interrupt */
    HAL_NVIC_EnableIRQ(MFX_INT_EXTI_IRQn);    
    
    if(statusGpio & TS_INT_PIN)
    {
      // Signal touch sampling task
      osSemaphoreRelease(touchBinarySemHandle);
    }
  }
  /* USER CODE END StartMfxServiceTask */
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __asm("bkpt #0");
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
